# AnalysisDisplayColorEntry Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorEntry Class
Members See Also
---
Contains one entry of intermediate colors in color settings for analysis display style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class AnalysisDisplayColorEntry : IDisposable
```

Visual Basic
---
```text
Public Class AnalysisDisplayColorEntry _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AnalysisDisplayColorEntry : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..AnalysisDisplayColorEntry
# See Also
AnalysisDisplayColorEntry Members
Autodesk.Revit.DB.Analysis Namespace